benchmarks/parasiticRipples/N400/system/blockMeshDictOrg
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

L #calc "0.10";
Ha #calc "0.01";
Hw #calc "-0.05";
W #calc "0.0419";

vertices
(
 ( 0  0  0)//0
 ($L  0  0)//1
 ($L $W  0)//2
 ( 0 $W  0)//3
 ( 0  0 $Ha)//4
 ($L  0 $Ha)//5
 ($L $W $Ha)//6
 ( 0 $W $Ha)//7
 ( 0  0 $Hw)//8
 ($L  0 $Hw)//9
 ($L $W $Hw)//10
 ( 0 $W $Hw)//11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (150 60 20) simpleGrading (1 1 5)
    hex (8 9 10 11 0 1 2 3) (150 60 100) simpleGrading (1 1 0.2)
);

edges
(
);

boundary
(
    waterWall
    {
        type            wall;
        faces           ((8 9 10 11));
    }
    topWall
    {
        type            wall;
        faces           ((4 5 6 7));
    }
    sides1
    {
        type            cyclic;
        neighbourPatch  sides2;
        faces           ((1 5 4 0)
			 (8 9 1 0));
    }
    sides2
    {
        type            cyclic;
        neighbourPatch  sides1;
        faces           ((3 6 7 2)
			 (10 11 3 2));
    }
    
    inout1
    {
        type            cyclic;
        neighbourPatch  inout2;
        faces           ((0 4 7 3)
			 (0 8 11 3));
    }
    inout2
    {
        type            cyclic;
        neighbourPatch  inout1;
        faces           ((2 5 6 1)
			 (2 9 10 1));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
