benchmarks/parasiticRipples/N400/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    waterWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       559196;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       559296;
    }
    sides1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          279600;
        startFace       559396;
    }
    sides2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          279600;
        startFace       838996;
    }
    inout1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          604;
        startFace       1118596;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout2;
    }
    inout2
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          604;
        startFace       1119200;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inout1;
    }
)

// ************************************************************************* //
