benchmarks/parasiticRipples/N400/constant/waveProperties_0.08
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

seaLevel            0;

relaxationNames     ( );

initializationName  init;

initCoeffs
{
    waveType            streamFunction;
    N                   32;
    Tsoft               0;
    depth               1;
    phi                 0;
    height              0.08;

    specifyPeriod       false;
    period              0.77542418660115;
    waveLength          1;

    specifyEuler        true;
    eulerVelocity       0;

    omega               8.1029008583291;
    waveNumber          (6.28319 0 0);
    uBar                1.2896206465714;
    A                   nonuniform List<scalar>
    32
    (
        0.038841416541597
        0.0052226178103798
        0.0010786129338759
        0.00026668141501371
        7.2813172926491e-05
        2.1169501479344e-05
        6.4272925058768e-06
        2.014199793417e-06
...
    );
    B                   nonuniform List<scalar>
    32
    (
        0.30189985724055
        0.0050775634483498
        0.0004448128510986
        4.0999313112688e-05
        3.8577974096582e-06
        3.7249993080421e-07
        3.6757943245219e-08
        3.6903725144894e-09
...
    );
}



// ************************************************************************* //
