benchmarks/parasiticRipples/N400/system/ijkDict
{
cellSet refinedCells;
cyclicX true;
}
