benchmarks/parasiticRipples/N400/system/setAlphaFieldDict_0.08
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field           "alpha1";

type            randomWaveField;

amplitude       1;

waterLevel      0;

interfaceTol    1e-08;

nRows           3;

N               32;

height          0.08;

waveNumber          (6.28319 0 0);

A                  
32
(
 0.038841416541597
 0.0052226178103798
 0.0010786129338759
 0.00026668141501371
 7.2813172926491e-05
 2.1169501479344e-05
 6.4272925058768e-06
 2.014199793417e-06
 6.4664286771528e-07
 2.1158838106121e-07
 7.0306325290179e-08
 2.3659478704289e-08
 8.0469952364961e-09
 2.7617977492325e-09
 9.5529022677971e-10
 3.3267655442538e-10
 1.1654541721641e-10
 4.1044596773295e-11
 1.4522845879243e-11
 5.1601017954256e-12
 1.8400685002363e-12
 6.5792853630083e-13
 2.353358723833e-13
 8.3612146059565e-14
 2.886193159844e-14
 9.012110090575e-15
 1.8939742392002e-15
 -4.3373668470952e-16
 -8.8459047076405e-16
 -6.2589544482978e-16
 -2.4516686587545e-16
 -7.8409374855766e-17
 );
// ************************************************************************* //
