benchmarks/parasiticRipples/N400/system/setFieldsDictExample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(
    U
    {
        field       U;
        dimensions  [0 1 -1 0 0 0 0];

//        constants
//        {
//        }

        variables
        (
            "Retau = 395"
            "Ubar = 0.1335"
            "nu = 2e-05"
            "h = 1"
            "utau = Retau*nu/h"
            "y = (pos().y() <= h) ? pos().y() : 2.0*h - pos().y()"
            "yPlus = y*Retau/h"
            "xPlus = pos().x()*Retau/h"
            "zPlus = pos().z()*Retau/h"
            "duPlus = Ubar*0.25/utau"
            "betaPlus = 2.0*pi()/200.0"
            "sigma = 0.00055"
            "alphaPlus = 2.0*pi()/500.0"
            "epsilon = Ubar/200.0"
            "deviation = pos().x()/pos().x() + 0.4*(rand() - 0.5)"
        );

        condition
        #{
            (pos().x() > -10)
        #};

        expression
        #{
            vector
            (
                1.5*Ubar*pos().y()*(2.0*h - pos().y())
              + (utau*duPlus/2.0)*(yPlus/40.0)*exp(-sigma*sqr(yPlus) + 0.5)*cos(betaPlus*zPlus)*deviation,
                0.0,
                epsilon*sin(alphaPlus*xPlus)*yPlus*exp(-sigma*sqr(yPlus))*deviation
            )
        #};
    }
);

// ************************************************************************* //